Revit 2025 API
TileBrickType Enumeration
 The enumerated type representing the permitted values for the asset property "TileBrickType" from the "Tile" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum TileBrickType
Public Enumeration TileBrickType
public enum class TileBrickType
type TileBrickType
Members
Member name | Value | Description
RunningBond | 0
CommonFlemishBond | 1
EnglishBond | 2
HalfRunningBond | 3
StackBond | 4
FineRunningBond | 5
FineStackBond | 6
Custom | 7
See Also
Reference
Autodesk.Revit.DB.Visual Namespace